6HJS/CC2640R2F_BLE5/source/ti/blestack/boards/CC2640R2DK_CXS/CC2640R2DK_CXS.c
/*
 *  =============================== PIN ===============================
 */
#include <ti/drivers/PIN.h>
#include <ti/drivers/pin/PINCC26XX.h>

const PIN_Config BoardGpioInitTable[] = {

    CC2640R2DK_CXS_PIN_LED3 | PIN_GPIO_OUTPUT_EN | PIN_GPIO_LOW | PIN_PUSHPULL | PIN_DRVSTR_MAX,  /* LED initially off */
    CC2640R2DK_CXS_PIN_LED4 | PIN_GPIO_OUTPUT_EN | PIN_GPIO_LOW | PIN_PUSHPULL | PIN_DRVSTR_MAX,  /* LED initially off */
    CC2640R2DK_CXS_KEY_SELECT | PIN_INPUT_EN | PIN_PULLUP | PIN_HYSTERESIS,                   /* Button is active low */
    CC2640R2DK_CXS_KEY_UP | PIN_INPUT_EN | PIN_PULLUP | PIN_HYSTERESIS,                       /* Button is active low */
    CC2640R2DK_CXS_KEY_DOWN | PIN_INPUT_EN | PIN_PULLUP | PIN_HYSTERESIS,                     /* Button is active low */
    CC2640R2DK_CXS_KEY_LEFT | PIN_INPUT_EN | PIN_PULLUP | PIN_HYSTERESIS,                     /* Button is active low */
    CC2640R2DK_CXS_KEY_RIGHT | PIN_INPUT_EN | PIN_PULLUP | PIN_HYSTERESIS,                    /* Button is active low */
    CC2640R2DK_CXS_3V3_EN | PIN_GPIO_OUTPUT_EN | PIN_GPIO_LOW | PIN_PUSHPULL,                 /* 3V3 domain off initially */
    CC2640R2DK_CXS_UART_TX | PIN_GPIO_OUTPUT_EN | PIN_GPIO_HIGH | PIN_PUSHPULL,               /* UART TX pin at inactive level */

    PIN_TERMINATE
};

const PINCC26XX_HWAttrs PINCC26XX_hwAttrs = {
    .intPriority = ~0,
    .swiPriority = 0
};

/*
 *  =============================== Power ===============================
 */
#include <ti/drivers/Power.h>
#include <ti/drivers/power/PowerCC26XX.h>

const PowerCC26XX_Config PowerCC26XX_config = {
    .policyInitFxn      = NULL,
    .policyFxn          = &PowerCC26XX_standbyPolicy,
    .calibrateFxn       = &PowerCC26XX_calibrate,
    .enablePolicy       = TRUE,
#ifdef USE_RCOSC
    .calibrateRCOSC_LF  = TRUE,
#else
    .calibrateRCOSC_LF  = FALSE,
#endif
    .calibrateRCOSC_HF  = TRUE,
};

/*
 *  =============================== PWM ===============================
 *  Remove unused entries to reduce flash usage both in Board.c and Board.h
 */
#include <ti/drivers/PWM.h>
#include <ti/drivers/pwm/PWMTimerCC26XX.h>

PWMTimerCC26XX_Object pwmtimerCC26xxObjects[CC2640R2DK_CXS_PWMCOUNT];

const PWMTimerCC26XX_HwAttrs pwmtimerCC26xxHWAttrs[CC2640R2DK_CXS_PWMCOUNT] = {
    { .pwmPin = CC2640R2DK_CXS_PWMPIN0, .gpTimerUnit = CC2640R2DK_CXS_GPTIMER0A },
    { .pwmPin = CC2640R2DK_CXS_PWMPIN1, .gpTimerUnit = CC2640R2DK_CXS_GPTIMER0B },
    { .pwmPin = CC2640R2DK_CXS_PWMPIN2, .gpTimerUnit = CC2640R2DK_CXS_GPTIMER1A },
    { .pwmPin = CC2640R2DK_CXS_PWMPIN3, .gpTimerUnit = CC2640R2DK_CXS_GPTIMER1B },
    { .pwmPin = CC2640R2DK_CXS_PWMPIN4, .gpTimerUnit = CC2640R2DK_CXS_GPTIMER2A },
    { .pwmPin = CC2640R2DK_CXS_PWMPIN5, .gpTimerUnit = CC2640R2DK_CXS_GPTIMER2B },
    { .pwmPin = CC2640R2DK_CXS_PWMPIN6, .gpTimerUnit = CC2640R2DK_CXS_GPTIMER3A },
    { .pwmPin = CC2640R2DK_CXS_PWMPIN7, .gpTimerUnit = CC2640R2DK_CXS_GPTIMER3B },
};

const PWM_Config PWM_config[CC2640R2DK_CXS_PWMCOUNT] = {
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC2640R2DK_CXS_PWM0], &pwmtimerCC26xxHWAttrs[CC2640R2DK_CXS_PWM0] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC2640R2DK_CXS_PWM1], &pwmtimerCC26xxHWAttrs[CC2640R2DK_CXS_PWM1] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC2640R2DK_CXS_PWM2], &pwmtimerCC26xxHWAttrs[CC2640R2DK_CXS_PWM2] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC2640R2DK_CXS_PWM3], &pwmtimerCC26xxHWAttrs[CC2640R2DK_CXS_PWM3] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC2640R2DK_CXS_PWM4], &pwmtimerCC26xxHWAttrs[CC2640R2DK_CXS_PWM4] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC2640R2DK_CXS_PWM5], &pwmtimerCC26xxHWAttrs[CC2640R2DK_CXS_PWM5] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC2640R2DK_CXS_PWM6], &pwmtimerCC26xxHWAttrs[CC2640R2DK_CXS_PWM6] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC2640R2DK_CXS_PWM7], &pwmtimerCC26xxHWAttrs[CC2640R2DK_CXS_PWM7] },
};

const uint_least8_t PWM_count = CC2640R2DK_CXS_PWMCOUNT;

/*
 *  =============================== RF Driver ===============================
 *  Note: The BLE-Stack requires RF SWI priorities to be set to 5.
 */
#include <ti/drivers/rf/RF.h>

const RFCC26XX_HWAttrs RFCC26XX_hwAttrs = {
    .hwiCpe0Priority = ~0,
    .hwiHwPriority   = ~0,
    .swiCpe0Priority =  5,
    .swiHwPriority   =  5,
};

/*
 *  =============================== SPI DMA ===============================
 */
#include <ti/drivers/SPI.h>
#include <ti/drivers/spi/SPICC26XXDMA.h>

SPICC26XXDMA_Object spiCC26XXDMAObjects[CC2640R2DK_CXS_SPICOUNT];

const SPICC26XXDMA_HWAttrsV1 spiCC26XXDMAHWAttrs[CC2640R2DK_CXS_SPICOUNT] = {
    {
        .baseAddr           = SSI0_BASE,
        .intNum             = INT_SSI0_COMB,
        .intPriority        = ~0,
        .swiPriority        = 0,
        .powerMngrId        = PowerCC26XX_PERIPH_SSI0,
        .defaultTxBufValue  = 0,
        .rxChannelBitMask   = 1<<UDMA_CHAN_SSI0_RX,
        .txChannelBitMask   = 1<<UDMA_CHAN_SSI0_TX,
        .mosiPin            = CC2640R2DK_CXS_SPI0_MOSI,
        .misoPin            = CC2640R2DK_CXS_SPI0_MISO,
        .clkPin             = CC2640R2DK_CXS_SPI0_CLK,
        .csnPin             = CC2640R2DK_CXS_SPI0_CSN
    },
    {
        .baseAddr           = SSI1_BASE,
        .intNum             = INT_SSI1_COMB,
        .intPriority        = ~0,
        .swiPriority        = 0,
        .powerMngrId        = PowerCC26XX_PERIPH_SSI1,
        .defaultTxBufValue  = 0,
        .rxChannelBitMask   = 1<<UDMA_CHAN_SSI1_RX,
        .txChannelBitMask   = 1<<UDMA_CHAN_SSI1_TX,
        .mosiPin            = CC2640R2DK_CXS_SPI1_MOSI,
        .misoPin            = CC2640R2DK_CXS_SPI1_MISO,
        .clkPin             = CC2640R2DK_CXS_SPI1_CLK,
        .csnPin             = CC2640R2DK_CXS_SPI1_CSN
    }
};

const SPI_Config SPI_config[CC2640R2DK_CXS_SPICOUNT] = {
    {
         .fxnTablePtr = &SPICC26XXDMA_fxnTable,
         .object      = &spiCC26XXDMAObjects[CC2640R2DK_CXS_SPI0],
         .hwAttrs     = &spiCC26XXDMAHWAttrs[CC2640R2DK_CXS_SPI0]
    },
    {
         .fxnTablePtr = &SPICC26XXDMA_fxnTable,
         .object      = &spiCC26XXDMAObjects[CC2640R2DK_CXS_SPI1],
         .hwAttrs     = &spiCC26XXDMAHWAttrs[CC2640R2DK_CXS_SPI1]
    },
};

